In [1]:
import pandas as pd

# Groupby & Aggregation

In [2]:
data = {
    "Department": ["IT", "HR", "IT", "HR", "Sales", "IT"],
    "Employee": ["A", "B", "C", "D", "E", "F"],
    "Salary": [50000, 40000, 60000, 45000, 30000, 55000]
}

df = pd.DataFrame(data)
print(df)

  Department Employee  Salary
0         IT        A   50000
1         HR        B   40000
2         IT        C   60000
3         HR        D   45000
4      Sales        E   30000
5         IT        F   55000

In [5]:
# groupby single column
df.groupby("Department").sum()

           Employee  Salary
Department
HR               BD   85000
IT              ACF  165000
Sales             E   30000

In [6]:
df.groupby("Department")["Salary"].mean()

Department
HR       42500.0
IT       55000.0
Sales    30000.0
Name: Salary, dtype: float64

In [7]:
df.groupby("Department")["Salary"].count()

Department
HR       2
IT       3
Sales    1
Name: Salary, dtype: int64

In [8]:
# groupby multiple column 
df.groupby(["Department", "Employee"]).sum()

                     Salary
Department Employee
HR         B          40000
           D          45000
IT         A          50000
           C          60000
           F          55000
Sales      E          30000

In [9]:
# Using as_index=False
# Normally groupby makes grouped column as index

df.groupby("Department", as_index=False).sum()

  Department Employee  Salary
0         HR       BD   85000
1         IT      ACF  165000
2      Sales        E   30000

In [10]:
# Iterating Through Groups
for dept, group in df.groupby("Department"):
    print(dept)
    print(group)

HR
  Department Employee  Salary
1         HR        B   40000
3         HR        D   45000
IT
  Department Employee  Salary
0         IT        A   50000
2         IT        C   60000
5         IT        F   55000
Sales
  Department Employee  Salary
4      Sales        E   30000

In [11]:
# Using apply() with groupby
df.groupby("Department")["Salary"].apply(lambda x: x.max() - x.min())

Department
HR        5000
IT       10000
Sales        0
Name: Salary, dtype: int64

In [14]:
# Using transform()
df["Dept_Avg"] = df.groupby("Department")["Salary"].transform("mean")
print(df["Department"])

0       IT
1       HR
2       IT
3       HR
4    Sales
5       IT
Name: Department, dtype: object

In [15]:
# Using filter()
df.groupby("Department").filter(lambda x: x["Salary"].sum() > 100000)

  Department Employee  Salary  Dept_Avg
0         IT        A   50000   55000.0
2         IT        C   60000   55000.0
5         IT        F   55000   55000.0